sulaolab/dspic33ak-hal-starter/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33a.c
    if( ( addr < base ) || ( addr >= end ) )
    {
        return -1;
    }
    return ( addr >= mid ) ? 1 : 0;
}


/*
 * Diagnostic: the TX DMA's CURRENT read position as a word offset into the full ping-pong
 * buffer [0, 2*half). Returns -1 if stopped or the live DMAxSRC snapshot is out of range.
 *
 * Finer than tx_active_half(): lets a phase probe measure the SUB-block sample offset
 * between two co-clocked legs (equal half but different position => a fixed offset that can
 * still tear a late cross-fill write). Sample at a deterministic instant and diff two legs.
 */
int32_t nora_spi_i2s_tdm_inst_tx_active_pos( nora_spi_i2s_tdm_inst_t* inst )
{
    if( ( inst == NULL ) || !inst->running )
    {
        return -1;
    }
    const uint32_t  half = (uint32_t)inst->geom_slots_per_fs * inst->geom_block_frames;
    const uintptr_t base = (uintptr_t)&inst->tx_buffer[ 0 ];
    const uintptr_t end  = (uintptr_t)&inst->tx_buffer[ 2u * half ];
    const uintptr_t addr = (uintptr_t)nora_dma_read_src_hot( (nora_dma_channel_t)inst->tx_dma_ch );

    if( ( addr < base ) || ( addr >= end ) )
    {
        return -1;
    }
    return (int32_t)( ( addr - base ) / sizeof(int32_t) );   // 0 .. 2*half-1
}


/*
 * Register or clear one SPI instance's audio-block callback.
 *
 * That instance's RX-block ISR calls this hook once per completed block. The update
 * is bracketed by briefly masking the instance's RX DMA IE so the ISR cannot observe
 * a torn cb/user pair.
 *
 * Returns false (and changes nothing) if the contract is violated: NULL inst, or the
 * instance is running and the call would CHANGE the (cb,user) pair -- the callback must
 * be registered before inst_start() and not swapped/cleared mid-stream. Re-registering
 * the identical (cb,user) while running is allowed (idempotent no-op -> true).
 */
bool nora_spi_i2s_tdm_set_block_callback( nora_spi_i2s_tdm_inst_t* inst,
                                               nora_spi_i2s_tdm_block_cb_t cb,
                                               void* user )
{
    bool     rxie_bak;

    if( inst == NULL )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE );
        return false;
    }

    // While running, only a no-op re-register of the same pair is permitted.
    if( inst->running && ( cb != inst->block_cb || user != inst->block_user ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING );
        return false;
    }

    rxie_bak = tdm_rx_ie_disable( inst->rx_dma_ch );

    inst->block_cb   = cb;
    inst->block_user = user;

    tdm_rx_ie_restore( inst->rx_dma_ch, rxie_bak );
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


/*
 * Open the shared board/clock port for the engine, ONCE, before any instance is started.
 *
 * Takes NO role argument: the clock role handed to the port hooks is DERIVED from the
 * committed primary leg (primary_leg_index), so the pin/clock direction can never disagree
 * with the configured stream (a caller can no longer pass a role that contradicts the
 * committed config). Brings up + checks the external clock and routes pins/CLC through the
 * registered port hooks (all optional). Returns false if the primary leg is not configured
 * (ERR_NOT_CONFIGURED), the external clock cannot be brought up / is not ready, or a pin/CLC
 * hook rejects the role -- the caller must then not start any instance. With no port
 * registered this is a no-op success (self-clocked). It does NOT block waiting for a clock
 * (single readiness check) and does NOT touch any SPI/DMA -- per-instance start arms the
 * hardware. A board hook that also routes a SECONDARY leg reads that leg's committed role via
 * nora_spi_i2s_tdm_inst_get_setup() and skips a leg left unconfigured.
 */
bool nora_spi_i2s_tdm_open( void )
{
    const tdm_stream_t *stream = &s_stream;

    // Idempotent: a second open() while already open must NOT re-run the port hooks (they
    // have side effects -- external-clock bring-up, CLC engage) -- just succeed.
    if( s_stream.opened )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
        return true;
    }

    // Verify the shared-engine topology ONCE here, before any clock/pin bring-up:
    // primary_leg_index in range, distinct physical SPIs, and distinct DMA channels across
    // all legs. This catches a leg-table misconfig (e.g. two legs on the same SPI, or a
    // crossed DMA channel) that the per-leg tdm_spi_leg_is_valid() check at configure/start
    // cannot see.
    if( !tdm_stream_topology_is_valid( stream ) )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_TOPOLOGY );
        return false;
    }

    // Derive the clock role from the COMMITTED primary leg (never from a caller argument).
    // The primary MUST be configured -- open() with an unconfigured primary is a contract
    // error, not a silent SLAVE default.
    const tdm_spi_leg_t *primary = tdm_stream_primary_leg( stream );
    if( ( primary == NULL ) || !primary->config_valid )
    {
        tdm_set_error( NORA_SPI_I2S_TDM_ERR_NOT_CONFIGURED );
        return false;
    }
    const nora_spi_i2s_tdm_clock_role_t role = primary->config.clock_role;

    if( stream->port != NULL )
    {
        if( ( stream->port->clock_source_init != NULL ) && !stream->port->clock_source_init( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLOCK_INIT );
            return false;   // external clock could not be brought up (e.g. unsupported role)
        }
        if( ( stream->port->clock_source_ready != NULL ) && !stream->port->clock_source_ready( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLOCK_NOT_READY );
            return false;   // clock not ready yet -- caller retries open() later
        }
        if( ( stream->port->configure_pins != NULL ) && !stream->port->configure_pins( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_PIN_CONFIG );
            return false;   // role this board cannot pin-route
        }
        if( ( stream->port->clc_passthrough != NULL ) && !stream->port->clc_passthrough( role ) )
        {
            tdm_set_error( NORA_SPI_I2S_TDM_ERR_CLC );
            return false;
        }
    }
    s_stream.opened = true;   // port up: start/arm may now proceed
    tdm_set_error( NORA_SPI_I2S_TDM_ERR_NONE );
    return true;
}


