sulaolab/dspic33ak-hal-starter/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33a.c
    return true;
}


/*
 * Singleton load/status readers: report the PRIMARY leg (primary_leg_index, default logical leg 0).
 * Thin wrappers over the per-instance readers; behaviour is unchanged from before the
 * per-instance API was added. They go through s_stream.legs (the stream is the single
 * source for the leg table, same as is_running()/is_active()) rather than s_spi_legs
 * directly, and use a mutable leg because the per-instance readers honour clear_peak. Guard
 * the index (fail closed -> false) so an out-of-range primary never dereferences the table.
 */
bool nora_spi_i2s_tdm_get_load( nora_spi_i2s_tdm_load_t* monitor, bool clear_peak )
{
    if( s_stream.primary_leg_index >= s_stream.leg_count )
    {
        return false;
    }
    return nora_spi_i2s_tdm_inst_get_load( &s_stream.legs[s_stream.primary_leg_index], monitor, clear_peak );
}

bool nora_spi_i2s_tdm_get_status( nora_spi_i2s_tdm_status_t* status, bool clear_peak )
{
    if( s_stream.primary_leg_index >= s_stream.leg_count )
    {
        return false;
    }
    return nora_spi_i2s_tdm_inst_get_status( &s_stream.legs[s_stream.primary_leg_index], status, clear_peak );
}


//===========================================================
// Engine-wide TDMsum (combined TDM-occupancy) profiler: masked public wrappers.
//
// The profiler global is written by EVERY TDM RX-block ISR (enter/exit hooks in tdm_rx_block).
// Those ISRs share PRIO_TDM_DMA and never preempt each other, but a FOREGROUND access is still
// non-atomic against them on this 16-bit core, so each wrapper masks EVERY configured leg's RX
// DMA IE around the profiler call (the same bracket the per-leg readers use, generalised to all
// legs). The raw profiler ops do no masking themselves.
//===========================================================

// Disable every configured leg's RX DMA IE, saving prior enables into `bak[]` (indexed by leg).
static inline void tdm_all_rx_ie_disable( bool bak[TDM_SPI_LEG_COUNT] )
{
    uint8_t i;
    for( i = 0u; i < s_stream.leg_count; i++ )
    {
        bak[i] = tdm_rx_ie_disable( s_stream.legs[i].rx_dma_ch );
    }
}

// Restore every configured leg's RX DMA IE from `bak[]` (re-arms only those previously enabled).
static inline void tdm_all_rx_ie_restore( const bool bak[TDM_SPI_LEG_COUNT] )
{
    uint8_t i;
    for( i = 0u; i < s_stream.leg_count; i++ )
    {
        tdm_rx_ie_restore( s_stream.legs[i].rx_dma_ch, bak[i] );
    }
}

void nora_spi_i2s_tdm_tdmsum_configure( uint32_t window_period_ticks )
{
    bool bak[TDM_SPI_LEG_COUNT];
    const uint32_t now = nora_high_res_timer_get_count();

    tdm_all_rx_ie_disable( bak );
    nora_spi_i2s_tdm_dspic33a_sumprof_configure( now, window_period_ticks );
    tdm_all_rx_ie_restore( bak );
}

void nora_spi_i2s_tdm_tdmsum_reset( void )
{
    bool bak[TDM_SPI_LEG_COUNT];
    const uint32_t now = nora_high_res_timer_get_count();

    tdm_all_rx_ie_disable( bak );
    nora_spi_i2s_tdm_dspic33a_sumprof_reset( now );
    tdm_all_rx_ie_restore( bak );
}

bool nora_spi_i2s_tdm_tdmsum_get( nora_spi_i2s_tdm_tdmsum_t* out, bool clear_peak )
{
    bool bak[TDM_SPI_LEG_COUNT];

    if( out == NULL )
    {
        return false;
    }

    tdm_all_rx_ie_disable( bak );
    nora_spi_i2s_tdm_dspic33a_sumprof_snapshot( out, clear_peak );
    tdm_all_rx_ie_restore( bak );

    return out->initialized;
}


//===========================================================
// DMA INTERRUPT VECTORS  --  IMPORTANT: these ARE the IVT entries the CPU jumps to.
//
// The HAL ships its own DMA interrupt vectors so the transport is turnkey: link the HAL
// and the _DMAnInterrupt slots are filled, the DMA channels are already armed by
// start(), and the integrator only registers a per-instance block callback. (Previously
// these lived in a separate optional TU nora_spi_i2s_tdm_irq.c + a forwarding
// worker; folded back here -- no cross-TU hop -- since the toolchain/IVT coupling is
// confined to this one section.)
//
// One explicit RX vector per leg. Each RX vector runs that leg's block ISR (tdm_rx_block
// with THIS leg + its RX/TX channels + its slots*blk half size, ALL compile-time
// constants so the DMA register access / pointer math fold, with NO runtime channel->leg
// lookup). The TX channel is INTENTIONALLY interrupt-less (hw.c enables the CPU IRQ on the
// RX channel only): TX is fire-and-forget ping-pong with auto-reload, so RX completion
// alone defines the block boundary -- there is no TX ISR.
//
// The vector NAME (_DMA<n>Interrupt) encodes the DMA channel, so each vector is bound to
// its conf.h RX-DMA channel by a compile-time assert: at the default mapping this defines
//     _DMA0Interrupt   (leg SPI1 RX, DMA0)
//     _DMA2Interrupt   (leg SPI2 RX, DMA2, when NORA_TDM_USE_SPI2)
// Change an RX-DMA channel macro in conf.h and the build FAILS (assert) until the vector
// name + its assert are updated to match. IVT slots are chip-wide exclusive; a genuine
// clash surfaces as a duplicate-_DMAnInterrupt link error.
//===========================================================

// One RX interrupt vector per leg. tdm_rx_block is static inline (same TU) so
// the constant RX/TX channels + half size fold into the register access. (tx) is still
// passed -- tdm_rx_block reads the TX channel's DMA address to pick the writable TX half
// -- but the TX channel itself raises no interrupt (interrupt-less; see above).
//
// Compiled only when the HAL owns the IVT (NORA_TDM_DEFINE_DMA_VECTORS=1, default).
// With =0 the integrator owns the vectors and calls nora_spi_i2s_tdm_inst_rx_isr()
// (below) from their own _DMA<rx>Interrupt instead.
#if NORA_TDM_DEFINE_DMA_VECTORS
// Explicit HAL-owned RX vectors (was X-macro-generated). tdm_rx_block is same-TU static inline, so
// the literal channel numbers + half size fold into the register access -- NO runtime channel->leg
// lookup. The vector NAME encodes the DMA channel number, so bind each name to its conf.h channel
// with a compile-time assert: change the RX-DMA channel macro and the build FAILS until the vector
// name (and its assert) is updated to match. (tx) is passed so tdm_rx_block can pick the writable TX
// half; the TX channel raises no interrupt.
#if NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI3_RX_DMA == 4 );   /* logical A -> _DMA4Interrupt */
void __attribute__((interrupt, context)) _DMA4Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI1],
                  NORA_TDM_SPI3_RX_DMA, NORA_TDM_SPI3_TX_DMA,
                  TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#else
TDM_COMPILEASSERT( NORA_TDM_SPI1_RX_DMA == 0 );   /* _DMA0Interrupt binding */
void __attribute__((interrupt, context)) _DMA0Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI1],
                  NORA_TDM_SPI1_RX_DMA, NORA_TDM_SPI1_TX_DMA,
                  TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#endif
#if NORA_TDM_USE_SPI2
#if NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI4_RX_DMA == 6 );   /* logical B -> _DMA6Interrupt */
void __attribute__((interrupt, context)) _DMA6Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI2],
                  NORA_TDM_SPI4_RX_DMA, NORA_TDM_SPI4_TX_DMA,
                  TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#else
TDM_COMPILEASSERT( NORA_TDM_SPI2_RX_DMA == 2 );   /* _DMA2Interrupt binding */
void __attribute__((interrupt, context)) _DMA2Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI2],
                  NORA_TDM_SPI2_RX_DMA, NORA_TDM_SPI2_TX_DMA,
                  TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#endif
#endif // NORA_TDM_USE_SPI2
#if NORA_TDM_USE_SPI3 && !NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI3_RX_DMA == 4 );   /* _DMA4Interrupt binding */
void __attribute__((interrupt, context)) _DMA4Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI3],
                  NORA_TDM_SPI3_RX_DMA, NORA_TDM_SPI3_TX_DMA,
                  TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#endif // NORA_TDM_USE_SPI3
#if NORA_TDM_USE_SPI4 && !NORA_TDM_BASE_ON_SPI34
TDM_COMPILEASSERT( NORA_TDM_SPI4_RX_DMA == 6 );   /* _DMA6Interrupt binding */
void __attribute__((interrupt, context)) _DMA6Interrupt(void)
{
    tdm_rx_block( &s_spi_legs[TDM_SPI_LEG_SPI4],
                  NORA_TDM_SPI4_RX_DMA, NORA_TDM_SPI4_TX_DMA,
                  TDM_LEG_HALF_WORDS(NORA_TDM_SLOTS_PER_FS, NORA_TDM_BLOCK_FRAMES) );
}
#endif // NORA_TDM_USE_SPI4
#endif // NORA_TDM_DEFINE_DMA_VECTORS

