sulaolab/dspic33ak-hal-starter/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33a.c
/*
 * Public RX-block ISR entry for ONE instance (vector-ownership opt-out path).
 *
 * Runs the same block work as the HAL's own explicit _DMA<rx>Interrupt vector, but is a plain
 * (non-interrupt) function the integrator calls from their OWN _DMA<rx>Interrupt when
 * NORA_TDM_DEFINE_DMA_VECTORS=0. Channels + half size come from the leg at runtime
 * (the explicit turnkey vectors fold them as constants; this dispatch trades that for
 * IVT ownership). NULL inst is ignored. Call it for the instance's RX channel only --
 * TX is interrupt-less.
 */
void nora_spi_i2s_tdm_inst_rx_isr( nora_spi_i2s_tdm_inst_t* inst )
{
    if( inst == NULL )
    {
        return;
    }
    tdm_rx_block( inst, inst->rx_dma_ch, inst->tx_dma_ch,
                  (uint32_t)inst->geom_slots_per_fs * (uint32_t)inst->geom_block_frames );
}


//===========================================================
// Local Function
//===========================================================

/*
 * Clear one instance's DMA ping-pong buffers (RX + TX).
 *
 * This covers transport buffers only. Application processing buffers are deliberately
 * outside the HAL's ownership boundary.
 */
static void tdm_inst_clear_buffers( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return;
    }
    tdm_zero_memory( leg->tx_buffer, leg->buffer_word_count * sizeof(leg->tx_buffer[0]) );
    tdm_zero_memory( leg->rx_buffer, leg->buffer_word_count * sizeof(leg->rx_buffer[0]) );
}


/*
 * Tiny local memset(0) helper.
 *
 * Keeps this embedded HAL independent of the C library's memset implementation
 * and safely accepts NULL for callers that are already walking descriptor tables.
 */
static void tdm_zero_memory(void *ptr, size_t bytes)
{
    uint8_t *p = (uint8_t *)ptr;

    if( p == NULL )
    {
        return;
    }

    while( bytes > 0u )
    {
        *p = 0u;
        p++;
        bytes--;
    }
}


/*
 * Stop one instance's DMA activity.
 *
 * Its RX/TX interrupts are masked first so the ISR cannot refill buffers while the
 * channels are being disabled. The DMA controller global ON state is intentionally
 * untouched because other subsystems may be using DMA.
 */
static void tdm_inst_soft_stop_dma( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return;
    }
    nora_dma_irq_enable( leg->rx_dma_ch, false );
    nora_dma_irq_enable( leg->tx_dma_ch, false );
    (void)nora_dma_channel_enable( leg->rx_dma_ch, false );
    (void)nora_dma_channel_enable( leg->tx_dma_ch, false );
}


/*
 * Clear one instance's pending DMA status and CPU interrupt flags.
 *
 * Status is cleared before IRQ flags so stale HALF/DONE conditions cannot
 * immediately retrigger on the next start.
 */
static void tdm_inst_clear_dma_flags( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return;
    }
    nora_dma_clear_status( leg->rx_dma_ch );
    nora_dma_clear_status( leg->tx_dma_ch );
    nora_dma_clear_irq_flag( leg->rx_dma_ch );
    nora_dma_clear_irq_flag( leg->tx_dma_ch );
}


/*
 * Validate one private SPI leg descriptor.
 *
 * Checks only descriptor-local invariants: a known SPI instance, distinct RX/TX
 * DMA channels, non-NULL buffers, and a non-zero buffer length. Cross-leg
 * singleton rules are enforced by tdm_stream_topology_is_valid().
 */
static bool tdm_spi_leg_is_valid( const tdm_spi_leg_t *leg )
{
    if( leg == NULL )
    {
        return false;
    }
    if( (unsigned)leg->spi_inst >= (unsigned)TDM_SPI_INST_COUNT )
    {
        return false;
    }
    if( leg->rx_dma_ch == leg->tx_dma_ch )
    {
        return false;
    }
    if( ( leg->rx_buffer == NULL ) || ( leg->tx_buffer == NULL ) )
    {
        return false;
    }
    if( leg->buffer_word_count == 0u )
    {
        return false;
    }
    return true;
}


/*
 * Validate the private stream topology.
 *
 * Generic over the instance count (1..TDM_SPI_INST_COUNT): every leg is descriptor-
 * valid, the primary_leg_index is in range (it selects the leg the singleton
 * is_running()/get_status()/get_load()/is_active() API reports), and all legs use
 * distinct physical SPIs and distinct DMA channels (cross-leg loop below). The physical
 * SPI and the RX/TX DMA channels per leg are set on the leg descriptors; NOTHING here is
 * pinned to a specific SPI number or channel, so adding a leg or remapping a leg's channels
 * needs no edit to this check.
 *
 * primary_leg_index is only a reporting default -- NOT a clock-role constraint (clock role
 * is per-leg) and NOT a timing coupling (every leg times itself via its own RX-block ISR).
 */
static bool tdm_stream_topology_is_valid( const tdm_stream_t *stream )
{
    if( ( stream == NULL ) ||
        ( stream->legs == NULL ) ||
        ( stream->leg_count == 0u ) ||
        ( stream->leg_count > (uint8_t)TDM_SPI_INST_COUNT ) ||
        ( stream->primary_leg_index >= stream->leg_count ) )
    {
        return false;
    }

    for( uint8_t i = 0u; i < stream->leg_count; i++ )
    {
        if( !tdm_spi_leg_is_valid( &stream->legs[i] ) )
        {
            return false;
        }
    }

    for( uint8_t i = 0u; i < stream->leg_count; i++ )
    {
        for( uint8_t j = (uint8_t)(i + 1u); j < stream->leg_count; j++ )
        {
            const tdm_spi_leg_t *a = &stream->legs[i];
            const tdm_spi_leg_t *b = &stream->legs[j];

            if( a->spi_inst == b->spi_inst )
            {
                return false;
            }
            if( ( a->rx_dma_ch == b->rx_dma_ch ) ||
                ( a->rx_dma_ch == b->tx_dma_ch ) ||
                ( a->tx_dma_ch == b->rx_dma_ch ) ||
                ( a->tx_dma_ch == b->tx_dma_ch ) )
            {
                return false;
            }
        }
    }

    return true;
}


/*
 * Return the stream's PRIMARY leg -- the one the arg-less singleton status API
 * (is_running/is_active/get_status/get_load) reports.
 *
 * It is simply legs[primary_leg_index]; returns NULL if the stream/table is absent or the
 * index is out of range (fail closed). Not a clock master and not a timing coupling --
 * every leg times itself via its own RX-block ISR.
 */
static const tdm_spi_leg_t *tdm_stream_primary_leg( const tdm_stream_t *stream )
{
    if( ( stream == NULL ) ||
        ( stream->legs == NULL ) ||
        ( stream->primary_leg_index >= stream->leg_count ) )
    {
        return NULL;
    }
    return &stream->legs[stream->primary_leg_index];
}


